import pandas as pd

df = pd.read_csv(folder/filename with extension)

df.shape  // shows rows,colm

df.info()  // shows rows,colm,datatypes

pd.set_option('display.max_columns',85)

df.head()    //print first 5 rows

df.tail()  //print last 5 rows by default

csv,schema,stackoverflow,series datatypes

In [1]:
import pandas as pd
import numpy as np

In [2]:
people = {
    "first" :["akanksha" , 'siddharth' , 'parveen'],
    "last":["shukla" , 'shukla' , 'shukla'],
    "age":["21" , '19' , '48']
}

In [3]:
data = pd.DataFrame(people)

In [4]:
data

       first    last age
0   akanksha  shukla  21
1  siddharth  shukla  19
2    parveen  shukla  48

In [5]:
value = {
    "first" : ["akanksha","amrutha","komal","ayushi"],
    "last": ["shukla","satheesan","kumawat","upadhaya"],
    "age":["21" , '19' , '48','21']
}

In [6]:
df = pd.DataFrame(value)

In [7]:
df

      first       last age
0  akanksha     shukla  21
1   amrutha  satheesan  19
2     komal    kumawat  48
3    ayushi   upadhaya  21

In [8]:
value["last"]      #values as list

['shukla', 'satheesan', 'kumawat', 'upadhaya']

In [9]:
df["last"]       #values(df) as dataframes

0       shukla
1    satheesan
2      kumawat
3     upadhaya
Name: last, dtype: object

//series is list of data or single column of rows of data one dimensional array

dataframes is a two dimensional array

In [10]:
df[["last","age"]]     #for multiple column output

        last age
0     shukla  21
1  satheesan  19
2    kumawat  48
3   upadhaya  21

In [11]:
df.columns

Index(['first', 'last', 'age'], dtype='object')

In [12]:
df.iloc[0]     #first row  iloc for integer location

first    akanksha
last       shukla
age            21
Name: 0, dtype: object

In [13]:
df.iloc[[0,1],2]   #inner braces for rows outer for column

0    21
1    19
Name: age, dtype: object

In [14]:
df.loc[[0,1]]       #loc search for integer label

      first       last age
0  akanksha     shukla  21
1   amrutha  satheesan  19

In [15]:
df.loc[[0,1],["first","last"]]

      first       last
0  akanksha     shukla
1   amrutha  satheesan

In [16]:
df.loc[0:2,"age"]

0    21
1    19
2    48
Name: age, dtype: object

In [17]:
df.set_index("first")   #set index of our desired

               last age
first
akanksha     shukla  21
amrutha   satheesan  19
komal       kumawat  48
ayushi     upadhaya  21

In [18]:
df          #does not change original data

      first       last age
0  akanksha     shukla  21
1   amrutha  satheesan  19
2     komal    kumawat  48
3    ayushi   upadhaya  21

In [19]:
df.set_index("first",inplace = True)   #change in original data

In [20]:
df

               last age
first
akanksha     shukla  21
amrutha   satheesan  19
komal       kumawat  48
ayushi     upadhaya  21

In [21]:
df.index

Index(['akanksha', 'amrutha', 'komal', 'ayushi'], dtype='object', name='first')

you can add index at the time of file loading 
df = pd.read_csv(folder/filename with extension ,index_col="colm_name" )

In [22]:
#filter

In [23]:
filt =(df["last"] =="shukla")

In [24]:
df[filt]

            last age
first
akanksha  shukla  21

In [25]:
df.loc[filt]   #for passing series of boolean

            last age
first
akanksha  shukla  21

In [26]:
df.loc[filt,"age"]

first
akanksha    21
Name: age, dtype: object

& for AND , | for OR

In [27]:
df.reset_index(inplace=True)

In [28]:
filt = (df['last'] =='shukla')&(df['first'] =='akanksha')

In [29]:
df.loc[filt ,"age"]

0    21
Name: age, dtype: object

In [30]:
df.loc[~filt ,"age"]   #(~)gives the opposite of our query

1    19
2    48
3    21
Name: age, dtype: object

In [31]:
surnames = ['shukla','pandey','kumawat']
filt = df['last'].isin(surnames)

In [32]:
df.loc[filt,"last"]

0     shukla
2    kumawat
Name: last, dtype: object

In [33]:
filt = df["first"].str.contains("akanksha")

In [34]:
df.loc[filt]

      first    last age
0  akanksha  shukla  21

In [35]:
filt

0     True
1    False
2    False
3    False
Name: first, dtype: bool

In [36]:
# UPDATION

In [37]:
df.columns = ["first_name", "last_name" ,"ages"]

In [38]:
df

  first_name  last_name ages
0   akanksha     shukla   21
1    amrutha  satheesan   19
2      komal    kumawat   48
3     ayushi   upadhaya   21

In [39]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME  LAST_NAME AGES
0   akanksha     shukla   21
1    amrutha  satheesan   19
2      komal    kumawat   48
3     ayushi   upadhaya   21

In [40]:
df.columns = df.columns.str.replace(" ","_")
df

  FIRST_NAME  LAST_NAME AGES
0   akanksha     shukla   21
1    amrutha  satheesan   19
2      komal    kumawat   48
3     ayushi   upadhaya   21

In [41]:
df.rename(columns={"FIRST_NAME":"first","LAST_NAME":"last","AGES":"age"},inplace = True)
df

      first       last age
0  akanksha     shukla  21
1   amrutha  satheesan  19
2     komal    kumawat  48
3    ayushi   upadhaya  21

In [42]:
df.loc[2,["last","age"]] = ["kumawat","19"]

In [43]:
df

      first       last age
0  akanksha     shukla  21
1   amrutha  satheesan  19
2     komal    kumawat  19
3    ayushi   upadhaya  21

In [44]:
df.loc[2,"age"] = "20"

In [45]:
df

      first       last age
0  akanksha     shukla  21
1   amrutha  satheesan  19
2     komal    kumawat  20
3    ayushi   upadhaya  21

In [46]:
df.at[2,"age"] = "19"

In [47]:
df

      first       last age
0  akanksha     shukla  21
1   amrutha  satheesan  19
2     komal    kumawat  19
3    ayushi   upadhaya  21

In [48]:
df["last"]

0       shukla
1    satheesan
2      kumawat
3     upadhaya
Name: last, dtype: object

In [49]:
df["last"].str.upper()

0       SHUKLA
1    SATHEESAN
2      KUMAWAT
3     UPADHAYA
Name: last, dtype: object

In [50]:
df

      first       last age
0  akanksha     shukla  21
1   amrutha  satheesan  19
2     komal    kumawat  19
3    ayushi   upadhaya  21

In [51]:
df["last"] = df["last"].str.lower()

In [52]:
df

      first       last age
0  akanksha     shukla  21
1   amrutha  satheesan  19
2     komal    kumawat  19
3    ayushi   upadhaya  21

#
APPLY
MAP
APPLYMAP
REPLACE

In [53]:
df["first"].apply(len)

0    8
1    7
2    5
3    6
Name: first, dtype: int64

In [54]:
def update_first(first):
    return first.upper()

In [55]:
df["first"].apply(update_first)

0    AKANKSHA
1     AMRUTHA
2       KOMAL
3      AYUSHI
Name: first, dtype: object

In [56]:
df["first"] = df["first"].apply(update_first)

In [57]:
df

      first       last age
0  AKANKSHA     shukla  21
1   AMRUTHA  satheesan  19
2     KOMAL    kumawat  19
3    AYUSHI   upadhaya  21

In [58]:
df["first"].apply(update_first)

0    AKANKSHA
1     AMRUTHA
2       KOMAL
3      AYUSHI
Name: first, dtype: object

In [59]:
df["first"] = df["first"].apply(lambda x:x.lower())

In [60]:
df

      first       last age
0  akanksha     shukla  21
1   amrutha  satheesan  19
2     komal    kumawat  19
3    ayushi   upadhaya  21

In [61]:
df.apply(len,axis="columns")

0    3
1    3
2    3
3    3
dtype: int64

In [62]:
df.apply(pd.Series.min)

first    akanksha
last      kumawat
age            19
dtype: object

In [63]:
df.apply(lambda x:x.min())

first    akanksha
last      kumawat
age            19
dtype: object

In [64]:
#APPLYMAP

 map applies in dataframes only not in series apply function  for individual element in dataframes

In [65]:
df.applymap(len)

C:\Users\akanksha\AppData\Local\Temp\ipykernel_7632\1485728669.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   first  last  age
0      8     6    2
1      7     9    2
2      5     7    2
3      6     8    2

In [66]:
df.map(len)

   first  last  age
0      8     6    2
1      7     9    2
2      5     7    2
3      6     8    2

In [67]:
df.map(str.lower)

      first       last age
0  akanksha     shukla  21
1   amrutha  satheesan  19
2     komal    kumawat  19
3    ayushi   upadhaya  21

In [68]:
#MAP

map only works with series used for substituting value in a series with another value

In [69]:
df["first"].map({"akanksha":"anushika",})

0    anushika
1         NaN
2         NaN
3         NaN
Name: first, dtype: object

In [70]:
df["first"] = df["first"].replace({"akanksha":"anushika"})

In [71]:
df

      first       last age
0  anushika     shukla  21
1   amrutha  satheesan  19
2     komal    kumawat  19
3    ayushi   upadhaya  21

In [72]:
df["first"] = df["first"].replace({"anushika":"akanksha"})

In [73]:
df

      first       last age
0  akanksha     shukla  21
1   amrutha  satheesan  19
2     komal    kumawat  19
3    ayushi   upadhaya  21

In [74]:
#ADD ROWS/COLM

In [75]:
df["first"]+" "+df["last"]

0      akanksha shukla
1    amrutha satheesan
2        komal kumawat
3      ayushi upadhaya
dtype: object

In [76]:
df["name"] = df["first"]+" "+df["last"]

In [77]:
df

      first       last age               name
0  akanksha     shukla  21    akanksha shukla
1   amrutha  satheesan  19  amrutha satheesan
2     komal    kumawat  19      komal kumawat
3    ayushi   upadhaya  21    ayushi upadhaya

In [78]:
df.drop(columns = ["first","last"],inplace = True)

In [79]:
df

  age               name
0  21    akanksha shukla
1  19  amrutha satheesan
2  19      komal kumawat
3  21    ayushi upadhaya

In [80]:
df["name"].str.split(" ",expand =True)

          0          1
0  akanksha     shukla
1   amrutha  satheesan
2     komal    kumawat
3    ayushi   upadhaya

In [81]:
df[["first","last"]] = df["name"].str.split(" ",expand =True)

In [82]:
df

  age               name     first       last
0  21    akanksha shukla  akanksha     shukla
1  19  amrutha satheesan   amrutha  satheesan
2  19      komal kumawat     komal    kumawat
3  21    ayushi upadhaya    ayushi   upadhaya

In [83]:
df.append({"first":"anushika","last":"pandey"},ignore_index = True)

AttributeError: 'DataFrame' object has no attribute 'append'

In [84]:
df.drop(index = 3)

  age               name     first       last
0  21    akanksha shukla  akanksha     shukla
1  19  amrutha satheesan   amrutha  satheesan
2  19      komal kumawat     komal    kumawat

In [85]:
df

  age               name     first       last
0  21    akanksha shukla  akanksha     shukla
1  19  amrutha satheesan   amrutha  satheesan
2  19      komal kumawat     komal    kumawat
3  21    ayushi upadhaya    ayushi   upadhaya

In [86]:
filt = df["last"] == "satheesan"
df.drop(index = df[filt].index)

  age             name     first      last
0  21  akanksha shukla  akanksha    shukla
2  19    komal kumawat     komal   kumawat
3  21  ayushi upadhaya    ayushi  upadhaya

In [89]:
#SORT   also works inplace command

In [92]:
df.sort_values(by="last",ascending=False)

  age               name     first       last
3  21    ayushi upadhaya    ayushi   upadhaya
0  21    akanksha shukla  akanksha     shukla
1  19  amrutha satheesan   amrutha  satheesan
2  19      komal kumawat     komal    kumawat

In [93]:
df.sort_values(by=["last","first"],ascending = False)   //for duplication then do it with first

  age               name     first       last
3  21    ayushi upadhaya    ayushi   upadhaya
0  21    akanksha shukla  akanksha     shukla
1  19  amrutha satheesan   amrutha  satheesan
2  19      komal kumawat     komal    kumawat

In [94]:
df.sort_values(by=["last","first"],ascending = [False,True])

  age               name     first       last
3  21    ayushi upadhaya    ayushi   upadhaya
0  21    akanksha shukla  akanksha     shukla
1  19  amrutha satheesan   amrutha  satheesan
2  19      komal kumawat     komal    kumawat

In [95]:
df

  age               name     first       last
0  21    akanksha shukla  akanksha     shukla
1  19  amrutha satheesan   amrutha  satheesan
2  19      komal kumawat     komal    kumawat
3  21    ayushi upadhaya    ayushi   upadhaya

In [96]:
df.sort_index()      //for reset sorting

  age               name     first       last
0  21    akanksha shukla  akanksha     shukla
1  19  amrutha satheesan   amrutha  satheesan
2  19      komal kumawat     komal    kumawat
3  21    ayushi upadhaya    ayushi   upadhaya

In [97]:
df["last"].sort_values()  //sort work on series object as well

2      kumawat
1    satheesan
0       shukla
3     upadhaya
Name: last, dtype: object

In [99]:
df["age"].nlargest(2)

TypeError: Cannot use method 'nlargest' with dtype object

In [100]:
df.nlargest(10,"age")

TypeError: Column 'age' has dtype object, cannot use method 'nlargest' with this dtype

df["age"].median()

In [102]:
df.median()

TypeError: Cannot convert [['21' '19' '19' '21']] to numeric

In [103]:
df.describe()

       age             name     first    last
count    4                4         4       4
unique   2                4         4       4
top     21  akanksha shukla  akanksha  shukla
freq     2                1         1       1

In [104]:
df["age"].value_counts()

age
21    2
19    2
Name: count, dtype: int64

In [105]:
df["age"].value_counts(normalize = True)      //gives percentage

age
21    0.5
19    0.5
Name: proportion, dtype: float64

GROUPING DATA
>SPLIT
>APPLY FUNCTION
>COMBINE RESULT

In [107]:
age_group = df.groupby(["age"])

In [108]:
age_group.get_group("19")

  age               name    first       last
1  19  amrutha satheesan  amrutha  satheesan
2  19      komal kumawat    komal    kumawat

In [111]:
#we can also get the same result by applying filter as well
filt = df["age"] == "19"
df.loc[filt]["name"].value_counts()

name
amrutha satheesan    1
komal kumawat        1
Name: count, dtype: int64

In [112]:
age_group["name"].value_counts()     //using groupby function

age  name
19   amrutha satheesan    1
     komal kumawat        1
21   akanksha shukla      1
     ayushi upadhaya      1
Name: count, dtype: int64

In [113]:
age_group["age"].median

age_group["age"].median().loc["19"]

age_group["age"].median().loc['akanksha']

age_group["age"].agg(["median","mean"])

In [118]:
age_group["age"].apply(lambda x:x.str.contains("akanksha").sum())

age
19    0
21    0
Name: age, dtype: int64